FKDD_COPY_DIFF_3_2026-02-14/Documents/СоставKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СоставKPI</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СоставKPI</xr:Item>
				<xr:Item>InformationRegister.ЦелевыеПоказатели</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Должности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитыватьСтавку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьОтрабВремя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборKPI</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>KPI</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчитыватьОтрабВремя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитыватьСтавку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьПлан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗнаковОкругления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПремиальныйФонд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БазоваяЧасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KPI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>Периодичность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>Неделя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>Декада</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>Месяц</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>Квартал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>Год</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
					<Comment>Произвольный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/СоставKPI/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ПроверитьОтображениеКолонкиКатегория(); 
	
	//ПравоKPI=обПраво("ДоступКKPI");
	//Если ПравоKPI=Перечисления.ПризнакОтветственности.Запрет или ПравоKPI=Перечисления.ПризнакОтветственности.ДЦ или Не ОбПраво("ФЭС") Тогда    //НК 17112015 запрещаем редактировать наборы ДЦ вообще
	//	ЭтаФорма.ТолькоПросмотр=Истина;
	//КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Периодичность=Перечисления.Периодичность.Месяц;
		Объект.Дата=НачалоГода(ТекущаяДата());
		Объект.СрокДействия=КонецГода(Объект.Дата);
		Объект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		Объект.Организация = Справочники.Организации.ОсновнаяОрганизация;
		
	КонецЕсли;
	
	СписокЗначения=Новый Массив;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	
	Элементы.Периодичность.СписокВыбора.ЗагрузитьЗначения(СписокЗначения);

	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли;	
	
	Мотивация.ПроверитьДоступностьОбъектаПоДатеЗапрета(Объект, ЭтаФорма,Объект.Дата, Объект.Организация,Объект.ПодразделениеКомпании);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьОтображениеКолонкиКатегория()
	
	мЕстьДанныеДляКолонки = Ложь;
	
	Для каждого СтрДолжности из Объект.Должности Цикл
		Если ТипЗнч(СтрДолжности.Должность) = Тип("СправочникСсылка.Должности") Тогда 
			Если СтрДолжности.Должность.КатегорийнаяДолжность Тогда
				мЕстьДанныеДляКолонки = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Должности.ПодчиненныеЭлементы.ДолжностиКатегория.Видимость = мЕстьДанныеДляКолонки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностиПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элементы.Должности.ТекущиеДанные = Неопределено Тогда
		
		ТекущаяСтрока =  Элементы.Должности.ТекущиеДанные;
		
		ТекущаяДолжность = ТекущаяСтрока.Должность;
		ТекущаяКатегория = ТекущаяСтрока.Категория;
		
		Если НЕ ТекущаяДолжность = Справочники.Должности.ПустаяСсылка() Тогда
			
			КлючОтбора = Новый ФиксированнаяСтруктура("Должность", ТекущаяДолжность);
			
			Элементы.НаборKPI.ОтборСтрок = КлючОтбора;
			//Элементы.НаборKPI.ОтборСтрок.Должность.Значение=ТекущаяДолжность;
			//Элементы.НаборKPI.ОтборСтрок.Должность.ВидСравнения=ВидСравнения.Равно;
			//Элементы.НаборKPI.ОтборСтрок.Должность.Использование=Истина;
			Элементы.ПремиальныйФонд.ОтборСтрок = КлючОтбора;
			//Элементы.ПремиальныйФонд.ОтборСтрок.Должность.Значение=ТекущаяДолжность;
			//Элементы.ПремиальныйФонд.ОтборСтрок.Должность.ВидСравнения=ВидСравнения.Равно;
			//Элементы.ПремиальныйФонд.ОтборСтрок.Должность.Использование=Истина;
			
		КонецЕсли;
		
		Если НЕ ТекущаяКатегория = Справочники.КатегорииДолжностейСотрудников.ПустаяСсылка() Тогда
			
			КлючОтбораКатегория = Новый ФиксированнаяСтруктура("Категория", ТекущаяКатегория);
	        Элементы.НаборKPI.ОтборСтрок = КлючОтбораКатегория;
			
			//Элементы.НаборKPI.ОтборСтрок.Категория.Значение=ТекущаяКатегория;
			//Элементы.НаборKPI.ОтборСтрок.Категория.ВидСравнения=ВидСравнения.Равно;
			//Элементы.НаборKPI.ОтборСтрок.Категория.Использование=Истина;
			Элементы.ПремиальныйФонд.ОтборСтрок = КлючОтбораКатегория;
			//Элементы.ПремиальныйФонд.ОтборСтрок.Категория.Значение=ТекущаяКатегория;
			//Элементы.ПремиальныйФонд.ОтборСтрок.Категория.ВидСравнения=ВидСравнения.Равно;
			//Элементы.ПремиальныйФонд.ОтборСтрок.Категория.Использование=Истина;
			
		КонецЕсли;
	
		ТекущаяДолжность=Элементы.Должности.ТекущиеДанные.Должность;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностиПередУдалением(Элемент, Отказ)
	
	Если Элементы.Должности.ТекущиеДанные<>Неопределено Тогда
		
		ТекущаяСтрока = Элементы.Должности.ТекущиеДанные;
		ТекущаяДолжность=ТекущаяСтрока.Должность;
		ТекущаяКатегория=ТекущаяСтрока.Категория;
		
	КонецЕсли;
	
	МС = Объект.НаборKPI.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Объект.НаборKPI.Удалить(Эл);
	КонецЦикла;
	
	МС=Объект.ПремиальныйФонд.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Объект.ПремиальныйФонд.Удалить(Эл);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура НаборKPIПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ=истина;
		Возврат;
	КонецЕсли;
	
	Если Элементы.Должности.ТекущиеДанные<>Неопределено Тогда
		
		ТекущаяСтрока = Элементы.Должности.ТекущиеДанные;
		ТекущаяДолжность=ТекущаяСтрока.Должность;
		ТекущаяКатегория=ТекущаяСтрока.Категория;
		
	Иначе
		
		ТекущаяДолжность=Неопределено;
		ТекущаяКатегория=Неопределено;
		Отказ=истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаборKPIПриАктивизацииСтроки(Элемент)
	
	Если Элементы.НаборKPI.ТекущиеДанные<>Неопределено Тогда
		
		ДолжностиПриАктивизацииСтроки(Элементы.Должности);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборKPIПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элементы.Должности.ТекущиеДанные<>Неопределено Тогда
		
		Если НоваяСтрока Тогда
			Элементы.НаборKPI.ТекущиеДанные.Должность=ТекущаяДолжность;
			Элементы.НаборKPI.ТекущиеДанные.Категория=ТекущаяКатегория;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаборKPIПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Элементы.Должности.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ПремиальныйФондПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Должности.ТекущиеДанные<>Неопределено Тогда
		ТекущаяДолжность=Элементы.Должности.ТекущиеДанные.Должность;
		ТекущаяКатегория=Элементы.Должности.ТекущиеДанные.Категория;

	Иначе
		ТекущаяДолжность=Неопределено;
		ТекущаяКатегория=Неопределено;
		Отказ=истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПремиальныйФондПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элементы.Должности.ТекущиеДанные<>Неопределено Тогда
		Если НоваяСтрока Тогда
			Элементы.ПремиальныйФонд.ТекущиеДанные.Должность=ТекущаяДолжность;
			Элементы.ПремиальныйФонд.ТекущиеДанные.Категория=ТекущаяКатегория;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	
	Если Объект.СрокДействия<Объект.Дата Тогда
		Сообщить("Срок действия не может быть меньше начала периода");
		Объект.СрокДействия=Объект.Дата;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка=Ложь;
	СписокЗначения=Новый СписокЗначений;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодичностьНачалоВыбораЗавершение", ЭтотОбъект), СписокЗначения, Элементы.Периодичность);

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда 
		
		Объект.Периодичность= ВыбранныйЭлемент.Значение;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДолжностиДолжностьПриИзменении(Элемент)
	
	МС=Объект.НаборKPI.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Эл.Должность=Элемент.Значение;
		Если ТекущаяДолжность <> Элемент.Значение Тогда
			Эл.Категория=Справочники.КатегорииДолжностейСотрудников.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
	МС=Объект.ПремиальныйФонд.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Эл.Должность=Элемент.Значение;
		Если ТекущаяДолжность <> Элемент.Значение Тогда
			Эл.Категория=Справочники.КатегорииДолжностейСотрудников.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Должности.ТекущиеДанные.Категория = Справочники.КатегорииДолжностейСотрудников.ПустаяСсылка();
	
	ДолжностиПриАктивизацииСтроки(Элемент);
	ПроверитьОтображениеКолонкиКатегория();
	
КонецПроцедуры

&НаКлиенте
Процедура ПремиальныйФондБазоваяЧастьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Если ТипЗнч(Элемент.Значение)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
	//	
	//	ТекущаяДолжность=Элементы.Должности.ТекущаяСтрока.Должность;
	//	ТекущаяКатегория=Элементы.Должности.ТекущаяСтрока.Категория;
	//	
	//	Запрос=Новый Запрос("ВЫБРАТЬ
	//	|	Спр.Ссылка КАК KPI
	//	|ИЗ
	//	|	Справочник.KPI КАК Спр
	//	|ГДЕ
	//	|	Спр.Активность
	//	|	И Спр.Категория = &Категория
	//	|	И Спр.Периодичность = &Периодичность
	//	|	И ((НЕ Спр.Ссылка В (&KPI))
	//	|			ИЛИ Спр.Ссылка = &ТекKPI)
	//	|	И Спр.Ссылка В(&KPIДолж)");
	//	Запрос.УстановитьПараметр("Дата",КонецДня(Объект.Дата));
	//	Запрос.УстановитьПараметр("ТекKPI",Элемент.Значение);
	//	Запрос.УстановитьПараметр("Категория",Перечисления.КатегорияKPI.ЦелевойПоказатель);
	//	Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
	//	//Запрос.УстановитьПараметр("KPIДолж",KPIДолж);
	//	ТЗ=ПремиальныйФонд.Выгрузить();
	//	
	//	ТекущаяДолжность = Элементы.ПремиальныйФонд.ТекущаяСтрока.Должность;
	//	
	//	МС=ТЗ.НайтиСтроки(Новый Структура("Должность,Категория",ТекДолжностьВ,ТекКатегория));
	//	
	//	ПромТаб=ТЗ.Скопировать(МС);
	//	
	//	МKPI=ПромТаб.ВыгрузитьКолонку("БазоваяЧасть");
	//	
	//	СпKPI=Новый СписокЗначений;
	//	СпKPI.ЗагрузитьЗначения(МKPI);
	//	Запрос.УстановитьПараметр("KPI",СпKPI);
	//	
	//	РЗ=Запрос.Выполнить().Выгрузить();
	//	
	//	М=РЗ.ВыгрузитьКолонку("KPI");
	//	Сп=Новый СписокЗначений;
	//	Сп.ЗагрузитьЗначения(М);
	//	
	//	
	//	
	//	Ф=Справочники.KPI.ПолучитьФормуВыбора();
	//	Ф.Отбор.Ссылка.ВидСравнения=ВидСравнения.ВСписке;
	//	Ф.Отбор.Ссылка.Значение=Сп;
	//	Ф.Отбор.Ссылка.использование=истина;
	//	Ф.ВладелецФормы=Элемент;
	//	Ф.РежимВыбора=Истина;
	//	СтандартнаяОбработка=ложь;
	//	Ф.ЗакрыватьПриЗакрытииВладельца=Истина;
	//	Ф.ЗакрыватьПриВыборе=Истина;
	//	Ф.ЭлементыФормы.СправочникСписок.ТекущаяСтрока=Элемент.Значение;
	//	Ф.Открыть();
	//	
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекущаяДолжность = Элементы.Должности.ТекущиеДанные.Должность;
	ТекущаяКатегория = Элементы.Должности.ТекущиеДанные.Категория;
	
	Если ТипЗнч(ВыбранноеЗначение)=Тип("Массив") Тогда
		НЭ=ВыбранноеЗначение[0];
		МС=Объект.ПремиальныйФонд.НайтиСтроки(Новый Структура("Должность,Категория,БазоваяЧасть",ТекущаяДолжность,ТекущаяКатегория,НЭ));
		Если МС.Количество()=0 Тогда
			Нов=Объект.ПремиальныйФонд.Добавить();
			Нов.Должность=ТекущаяДолжность;
			Нов.Категория=ТекущаяКатегория;
			Нов.БазоваяЧасть=НЭ;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьЗаполненностьКолонкиКатегория(Отказ); 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполненностьКолонкиКатегория(Отказ)
	
	Для каждого СтрДолжности из Объект.Должности Цикл
		Если ТипЗнч(СтрДолжности.Должность) = Тип("СправочникСсылка.Должности") Тогда 
			Если СтрДолжности.Должность.КатегорийнаяДолжность И СтрДолжности.Категория = Справочники.КатегорииДолжностей.ПустаяСсылка() Тогда
				Отказ = Истина;
				Сообщить("Для должности: " + СтрДолжности.Должность + "; в строке: " + СтрДолжности.НомерСтроки + ", не заполнена категория, запись отменена!",СтатусСообщения.ОченьВажное);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностиКатегорияПриИзменении(Элемент)
	
	МС = Объект.НаборKPI.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Эл.Категория=Элемент.Значение;
	КонецЦикла;
	
	МС=Объект.ПремиальныйФонд.НайтиСтроки(Новый Структура("Должность,Категория",ТекущаяДолжность,ТекущаяКатегория));
	Для Каждого Эл из МС Цикл
		Эл.Категория=Элемент.Значение;
	КонецЦикла;
	
	ДолжностиПриАктивизацииСтроки(Элемент);
	ПроверитьОтображениеКолонкиКатегория(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностиКатегорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(Элемент.Значение)=Тип("СправочникСсылка.Должности") ТОгда
		ТекущаяКатегория=Элемент.Значение;
		Если Элементы.Должности.ТекущиеДанные<>Неопределено Тогда
			ТекДолжность = Элементы.Должности.ТекущиеДанные.Должность;
		КонецЕсли;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КатегорийнаяДолжность", ТекущаяДолжность);
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор",ПараметрыОтбора);
	ПараметрыВыбора.Вставить("РежимВыбора",Истина);
	ПараметрыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыВыбора.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);

	ОткрытьФорму("Справочник.КатегорииДолжностейСотрудников.ФормаВыбора",ПараметрыВыбора,Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ДолжностиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущаяСтрока = Элементы.Должности.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено
		И ТекущаяСтрока.Должность.КатегорийнаяДолжность 
		И ТекущаяСтрока.Категория = Справочники.КатегорииДолжностей.ПустаяСсылка() Тогда
		
		 УсловноеОформлениеКрасный();
		 
	Иначе
		
		УсловноеОформлениеЧерный();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеКрасный()
	
	ЭлементУФ = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДолжностиКатегория);
	
	ОтборЭлемента = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Должности.Категория");
	
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;   
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);	

КонецПроцедуры	

&НаСервере
Процедура УсловноеОформлениеЧерный()
	
	ЭлементУФ = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДолжностиКатегория);
	
	ОтборЭлемента = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Должности.Категория");
	
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;   
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Черный);

КонецПроцедуры	

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("КомандаСотрудникиЗаполнитьЗавершение", ЭтотОбъект), "Таблица будет перезаполнена! Продолжить?",РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСотрудникиЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьПоДолжностям();
		
		ПроверитьОтображениеКолонкиКатегория();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДолжностям()

	Объект.Должности.Очистить();
	Объект.НаборKPI.Очистить();
	Объект.ПремиальныйФонд.Очистить();
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	Сотрудники.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.ЭтоГруппа
	|	И (Сотрудники.Подразделение = &Подразделение
	|			ИЛИ &ВсеПодразделения)
	|	И (НЕ Сотрудники.ДатаУвольнения < &Период
	|			ИЛИ Сотрудники.ДатаУвольнения = &Пусто)
	|	И Сотрудники.ДатаПриема < &Период
	|	И Сотрудники.ДатаПриема <> &Пусто
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Должность");
	
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ВсеПодразделения", Объект.ПодразделениеКомпании.Пустая());
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Пусто", Дата("01.01.01 00:00:00"));
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		НоваяСтрока= Объект.Должности.Добавить();
		НоваяСтрока.Должность = Результат.Должность;
		
	КонецЦикла;
	
КонецПроцедуры
